VSHEV92/Learning-STM32/STM-HAL/Examples/common/drivers/MAX7219/max7219.h
#ifndef MAX7219_H_
#define MAX7219_H_

#include "stdbool.h"

#ifdef STM32F042x6
    #include "stm32f0xx_hal_dma.h"
    #include "stm32f0xx_hal_spi.h"
    #include "stm32f0xx_hal_gpio.h"
#endif

#ifdef STM32F303xC
    #include "stm32f3xx_hal_dma.h"
    #include "stm32f3xx_hal_spi.h"
    #include "stm32f3xx_hal_gpio.h"
#endif

#ifdef STM32F411xE
    #include "stm32f4xx_hal_dma.h"
    #include "stm32f4xx_hal_spi.h"
    #include "stm32f4xx_hal_gpio.h"
#endif

#ifdef STM32H755xx
    #include "stm32h7xx_hal_dma.h"
    #include "stm32h7xx_hal_spi.h"
    #include "stm32h7xx_hal_gpio.h"
#endif


#define NUMBER_OF_DIGITS      8
#define SPI_PORT              hspi1

extern SPI_HandleTypeDef      SPI_PORT;

typedef enum {
    REG_NO_OP           = 0x00,
    REG_DIGIT_0         = 0x01,
    REG_DIGIT_1         = 0x02,
    REG_DIGIT_2         = 0x03,
    REG_DIGIT_3         = 0x04,
    REG_DIGIT_4         = 0x05,
    REG_DIGIT_5         = 0x06,
    REG_DIGIT_6         = 0x07,
    REG_DIGIT_7         = 0x08,
    REG_DECODE_MODE     = 0x09,
    REG_INTENSITY       = 0x0A,
    REG_SCAN_LIMIT      = 0x0B,
    REG_SHUTDOWN        = 0x0C,
    REG_DISPLAY_TEST    = 0x0F,
} MAX7219_REGISTERS;

typedef enum {
    MAX7219_SEG_G = (1<<0),
    MAX7219_SEG_F = (1<<1),
    MAX7219_SEG_E = (1<<2),
    MAX7219_SEG_D = (1<<3),
    MAX7219_SEG_C = (1<<4),
    MAX7219_SEG_B = (1<<5),
    MAX7219_SEG_A = (1<<6),
    MAX7219_SEG_DP = (1<<7),
} MAX7219_SEGMENTS;

typedef enum {
    MAX7219_SYM_0 = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F,
    MAX7219_SYM_1 = MAX7219_SEG_B | MAX7219_SEG_C,
    MAX7219_SYM_2 = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_G,
    MAX7219_SYM_3 = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_G,
    MAX7219_SYM_4 = MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_5 = MAX7219_SEG_A | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_6 = MAX7219_SEG_A | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_7 = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_C,
    MAX7219_SYM_8 = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_9 = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_A = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_B = MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_C = MAX7219_SEG_A | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F,
    MAX7219_SYM_D = MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_G,
    MAX7219_SYM_E = MAX7219_SEG_A | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_F = MAX7219_SEG_A | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_G = MAX7219_SEG_A | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F,
    MAX7219_SYM_H = MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_I = MAX7219_SEG_E | MAX7219_SEG_F,
    MAX7219_SYM_J = MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E,
    MAX7219_SYM_L = MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F,
    MAX7219_SYM_N = MAX7219_SEG_C | MAX7219_SEG_E | MAX7219_SEG_G,
    MAX7219_SYM_O = MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_G,
    MAX7219_SYM_P = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_Q = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_R = MAX7219_SEG_E | MAX7219_SEG_G,
    MAX7219_SYM_S = MAX7219_SYM_5,
    MAX7219_SYM_T = MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_U = MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_E | MAX7219_SEG_F,
    MAX7219_SYM_Y = MAX7219_SEG_B | MAX7219_SEG_C | MAX7219_SEG_D | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_MINUS = MAX7219_SEG_G,
    MAX7219_SYM_DEGREE = MAX7219_SEG_A | MAX7219_SEG_B | MAX7219_SEG_F | MAX7219_SEG_G,
    MAX7219_SYM_DOT = MAX7219_SEG_DP,
    MAX7219_SYM_BLANK = 0x00,
} MAX7219_SYMBOLS;

void max7219_Init();
void max7219_SetIntensivity(uint8_t intensivity);
void max7219_Clean(void);
void max7219_SendData(uint8_t addr, uint8_t data);
void max7219_TurnOn(void);
void max7219_TurnOff(void);

#endif /* MAX7219_H_ */
